app/controllers/comments_controller.rb

INSERT INTO "comments" ("post_id", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["post_id", 4], ["body", "aaaa"], ["created_at", "2017-08-20 22:27:21.341671"], ["updated_at", "2017-08-20 22:27:21.341671"]]
---
  def create
    comment = @post.comments.create! comments_params

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
    def set_post
      @post = Post.find(params[:post_id])